backend/src/tests/performance/artillery/load.yml
config:
  target: "http://localhost:5000"
  http:
    timeout: 20
  phases:
    - name: "warm-up"
      duration: 20
      arrivalRate: 2
    - name: "steady-load"
      duration: 40
      arrivalRate: 6
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Quiz read load (public)"
    weight: 3
    flow:
      - get:
          url: "/api/quizzes"

  - name: "Announcement read load (public)"
    weight: 3
    flow:
      - get:
          url: "/api/announcements"

  - name: "Grade read load (public)"
    weight: 3
    flow:
      - get:
          url: "/api/grades"

  - name: "Subject read load (public)"
    weight: 3
    flow:
      - get:
          url: "/api/subjects"

  - name: "Donor profile load (protected)"
    weight: 2
    flow:
      - get:
          url: "/api/donors/profile/{{$processEnvironment.DONOR_ID}}"
          headers:
            Authorization: "Bearer {{$processEnvironment.DONOR_TOKEN}}"

  - name: "Donation history load (protected)"
    weight: 2
    flow:
      - get:
          url: "/api/donations/my/{{$processEnvironment.DONOR_ID}}"
          headers:
            Authorization: "Bearer {{$processEnvironment.DONOR_TOKEN}}"

  - name: "Study Materials read load (public)"
    weight: 3
    flow:
      - get:
          url: "/api/study-materials"

  - name: "Study Material by ID load (public)"
    weight: 2
    flow:
      - get:
          url: "/api/study-materials/{{$processEnvironment.MATERIAL_ID}}"

  - name: "Study Sessions read load (protected)"
    weight: 2
    flow:
      - get:
          url: "/api/study-sessions"
          headers:
            Authorization: "Bearer {{$processEnvironment.TEACHER_TOKEN}}"

  - name: "Study Session by ID load (public)"
    weight: 2
    flow:
      - get:
          url: "/api/study-sessions/{{$processEnvironment.SESSION_ID}}"

  - name: "Teachers list load (public)"
    weight: 3
    flow:
      - get:
          url: "/api/teachers"

  - name: "Teacher profile load (protected)"
    weight: 2
    flow:
      - get:
          url: "/api/teachers/my-profile"
          headers:
            Authorization: "Bearer {{$processEnvironment.TEACHER_TOKEN}}"

  - name: "Pending teachers load (protected)"
    weight: 2
    flow:
      - get:
          url: "/api/teachers/pending"
          headers:
            Authorization: "Bearer {{$processEnvironment.ADMIN_TOKEN}}"